Sesi 6 Introduction python for data science Hacktive8

In [2]:
import numpy as np
import pandas as pd

In [3]:
revenues = pd.Series([555,7000,1980])
revenues

0     555
1    7000
2    1980
dtype: int64

In [4]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
city_revenues = pd.Series([555,7000,1980],index=['Amsterdam','Tokyo','Beijing'])
city_revenues

Amsterdam     555
Tokyo        7000
Beijing      1980
dtype: int64

In [6]:
city_employee_count = pd.Series({'Amsterdam':5,'Tokyo':8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [7]:
city_data = pd.DataFrame({'revenue':city_revenues,'employee_count':city_employee_count})
city_data

           revenue  employee_count
Amsterdam      555             5.0
Beijing       1980             NaN
Tokyo         7000             8.0

In [8]:
city_data.columns

Index(['revenue', 'employee_count'], dtype='object')

In [9]:
city_data.index

Index(['Amsterdam', 'Beijing', 'Tokyo'], dtype='object')

Penggabungan data dengan Concat dan Merge

In [10]:
further_city_data = pd.DataFrame({'revenue':[7000,3400],'employee_count':[2,2]},index=['New York','Barcelona'])
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [11]:
city_data

           revenue  employee_count
Amsterdam      555             5.0
Beijing       1980             NaN
Tokyo         7000             8.0

Defaultnya, .concat() menggabungjan sepanjang axis = 0 atau menambahkan baris sehingga jika ingin menambah kolom cukup sediakan parameter axis = 1.

In [12]:
#Concat vertikal
all_city_data = pd.concat([city_data,further_city_data])
all_city_data

           revenue  employee_count
Amsterdam      555             5.0
Beijing       1980             NaN
Tokyo         7000             8.0
New York      7000             2.0
Barcelona     3400             2.0

In [13]:
#Concat horizontal
city_countries = pd.DataFrame({'country':['Holland','Japan','Holland','Canada','Spain'],
                              'capital':[1,1,0,0,0]},
                             index=['Amsterdam','Tokyo','Rotterdam','Toronto','Barcelona'])
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [14]:
cities = pd.concat([all_city_data,city_countries],axis=1)
cities

           revenue  employee_count  country  capital
Amsterdam    555.0             5.0  Holland      1.0
Beijing     1980.0             NaN      NaN      NaN
Tokyo       7000.0             8.0    Japan      1.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [15]:
pd.concat([all_city_data,city_countries],axis=1,join='inner')
#join inner hanya menampilkan data yang beririsan pada concat.

           revenue  employee_count  country  capital
Amsterdam      555             5.0  Holland        1
Tokyo         7000             8.0    Japan        1
Barcelona     3400             2.0    Spain        0

Merge, Katakan ada 2 buah himpunan data A dan B <br>
Inner join $= A \cap B$ <br>
Full outer join $= A \cup B$ <br>
Left join $= A-B$ dan <br>
Right join $= B-A$.

In [16]:
countries = pd.DataFrame({'population_mil':[17,127,37],
                         'continent':["Europe",'Asia','North America']},index=['Holland','Japan','Canada'])
countries

         population_mil      continent
Holland              17         Europe
Japan               127           Asia
Canada               37  North America

In [19]:
countries2 = pd.DataFrame({'population_mil':[17,127,37],
                         'continent':["Europe",'Asia','North America'],
                          'country':['Holland','Japan','Canada']})
countries2

   population_mil      continent  country
0              17         Europe  Holland
1             127           Asia    Japan
2              37  North America   Canada

In [17]:
cities

           revenue  employee_count  country  capital
Amsterdam    555.0             5.0  Holland      1.0
Beijing     1980.0             NaN      NaN      NaN
Tokyo       7000.0             8.0    Japan      1.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [19]:
#Merge cities dengan countries 2 pada kolom country secara inner join
cities.merge(countries2,on='country',how='inner')

   revenue  employee_count  country  capital  population_mil      continent
0    555.0             5.0  Holland      1.0              17         Europe
1      NaN             NaN  Holland      0.0              17         Europe
2   7000.0             8.0    Japan      1.0             127           Asia
3      NaN             NaN   Canada      0.0              37  North America

In [20]:
#Merge cities dengan countries 2 pada kolom country secara full outer join
cities.merge(countries2,on='country',how='outer')

   revenue  employee_count  country  capital  population_mil      continent
0    555.0             5.0  Holland      1.0            17.0         Europe
1      NaN             NaN  Holland      0.0            17.0         Europe
2   1980.0             NaN      NaN      NaN             NaN            NaN
3   7000.0             2.0      NaN      NaN             NaN            NaN
4   7000.0             8.0    Japan      1.0           127.0           Asia
5   3400.0             2.0    Spain      0.0             NaN            NaN
6      NaN             NaN   Canada      0.0            37.0  North America

In [21]:
#Merge cities dengan countries 2 pada kolom country secara left join
cities.merge(countries2,on='country',how='left')

   revenue  employee_count  country  capital  population_mil      continent
0    555.0             5.0  Holland      1.0            17.0         Europe
1   1980.0             NaN      NaN      NaN             NaN            NaN
2   7000.0             8.0    Japan      1.0           127.0           Asia
3   7000.0             2.0      NaN      NaN             NaN            NaN
4   3400.0             2.0    Spain      0.0             NaN            NaN
5      NaN             NaN  Holland      0.0            17.0         Europe
6      NaN             NaN   Canada      0.0            37.0  North America

In [23]:
#Merge cities dengan countries 2 pada kolom country secara right join
cities.merge(countries2,on='country',how='right')

   revenue  employee_count  country  capital  population_mil      continent
0    555.0             5.0  Holland      1.0              17         Europe
1      NaN             NaN  Holland      0.0              17         Europe
2   7000.0             8.0    Japan      1.0             127           Asia
3      NaN             NaN   Canada      0.0              37  North America

Data Cleaning with Pandas

In [22]:
df = pd.read_csv('property_data.csv')
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 632.0+ bytes

In [24]:
df.isna().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

Standard missing values adalah kesalahan yang dapat dideteksi oleh Pandas, contohnya ialah datanya kosong atau berisi string "NA".

In [25]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [26]:
#True untuk nilai yang kosong tidak ada datanya
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [29]:
#() untuk mereplace data yang tidak ditemukan
df['ST_NUM'].fillna('x')

0    104.0
1    197.0
2        x
3    201.0
4    203.0
5    207.0
6        x
7    213.0
8    215.0
Name: ST_NUM, dtype: object

Non-standard missing values merupakan missing value yang berisikan value tidak sesuai dengan tipe datanya misal pada data jumlah yang umumnya berisikan tipe data numerik, jika ada data berisi string maka data tersebut termasuk missing values non-standard

In [32]:
#NS MVnya berupa "na" dan "--"
df.NUM_BEDROOMS

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7     --
8     na
Name: NUM_BEDROOMS, dtype: object

In [33]:
df['NUM_BEDROOMS'].isna()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

Terlihat bahwa "na" dan "--" masih dianggap salah, artinya mereka merupakan missing values yang tidak terdeteksi oleh pandas.

In [34]:
missing_values = ['--','na','n/a']
df2=pd.read_csv('property_data.csv',na_values=missing_values)
df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [37]:
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

'OWN_OCCUPIED' merupakan data bertipe objek, namun terdapat "12" pada data tersebut sehingga ia merupakan missing values yang tidak terdeteksi oleh  pandas.

In [35]:
cnt=0
for row in df2['OWN_OCCUPIED']:
    try:
        int(row)
        df2.loc[cnt,'OWN_OCCUPIED'] = np.nan
    except ValueError:
        pass
    cnt+=1

In [36]:
df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [40]:
#untuk pengecekan apakah ada null di tabel
df2.isna().values.any()

True

In [38]:
#untuk pengecekan jumlah value null per masing-masing kolom
df2.isna().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    4
NUM_BATH        1
SQ_FT           2
dtype: int64

In [39]:
# Untuk pengecekan jumlah null pada seluruh kolom
df2.isna().sum().sum()

12

Mengisi data null dengan median atau mean

In [41]:
df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           NaN        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [42]:
df2['NUM_BEDROOMS'].median()

3.0

In [43]:
df2['NUM_BEDROOMS'].fillna(df2['NUM_BEDROOMS'].median(),inplace=True)
df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           3.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           3.0        2  1800.0

In [44]:
#Kuis 1 tim 4
df2['SQ_FT'].fillna(df2['SQ_FT'].mean(),inplace=True)
df2

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5  1100.0
2  100003000.0     NaN   LEXINGTON            N           3.0        1   850.0
3  100004000.0   201.0    BERKELEY          NaN           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           3.0        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           3.0        1  1100.0
8  100009000.0   215.0     TREMONT            Y           3.0        2  1800.0